[Room] computations only succeeded without considering the following elements.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RoomsFailed { get; }
  Visual Basic
Public Shared ReadOnly Property RoomsFailed As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RoomsFailed {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RoomFailures Class
  Autodesk.Revit.DB Namespace